app/controllers/movies_controller.rb

  def same_director
    id = params[:id].to_i
    @movie = Movie.find(id)
    @movies = Movie.find_similar(@movie.director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 20]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Quentin Tarantino'